---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetMaterialGUID(System.Int32)
source: html/b394287b-bfa2-2fc9-e457-6afb7fbf064c.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetMaterialGUID Method

Gets the material GUID by its identifier.

## Syntax (C#)
```csharp
public Guid GetMaterialGUID(
	int materialId
)
```

## Parameters
- **materialId** (`System.Int32`) - The material identifier.

## Returns
The material GUID. Returns empty GUID if not found.